[
    {
        "summary": "本章介绍了工业工程在1880-1930年期间的发展年表，重点是弗雷德里克·W. 泰勒和弗兰克·B. 吉尔布雷斯的工作及其对工业工程领域的贡献。讨论了泰勒在科学管理发展中所起的作用以及吉尔布雷斯关于方法研究的理念，以及他们对工业工程的深远影响。随后，通过对比分析传统工程学科（土木、化学、电气和机械工程）的认证过程和标准，强调工业工程同样具有工程学科的科学性和严谨性。最后，探讨了工业工程原理和方法在非制造业（如银行、医院和政府职能）中的应用案例，展示了其广泛的适用性和实用性。",
        "example": [
            {
                "title": "泰勒与吉尔布雷斯的工作",
                "content": "泰勒提出了科学管理的理念，致力于通过优化工作流程来提高生产效率。吉尔布雷斯则专注于工作方法的研究，通过动作研究和时间研究来减少工作中的不必要动作和时间浪费。"
            },
            {
                "title": "工业工程在非制造业的应用案例",
                "content": "医院的流程改进、银行的运营优化以及政府部门的服务质量提升都应用了工业工程的原理和方法，通过标准化和优化操作流程来提高效率和服务质量。"
            }
        ]
    },
    {
        "summary": "本章节围绕工业与系统工程方法论展开讨论，主要内容包括分析大学的双层概念结构（人类活动系统和管理控制系统），评估工业工程师提高大学运作效率的关键活动（如流程优化、资源分配等），以及为工业与系统工程职能设计详细的绩效测评指标（如作业时间效率、错误率等）。图2.6被用于描述不同类型的可控系统，包括温度调节系统、导弹发射系统、枪弹射击精度目标、油罐车定量填充系统和淋浴恒温控制系统。每一个系统均具有特定的控制目标及参数特征，体现了系统工程在优化实际操作中的应用。",
        "example": [
            {
                "title": "双层概念分析法评估大学管理模式",
                "content": "2.2节提出利用两层概念结构分析组织系统的理论框架。以某大学为例：其'人类活动系统'要素包含教学研究活动（师生互动/实验项目）、学术支持服务（图书馆或行政后勤）；而'管理控制系统'则涵盖财务部门实施预算审批制度。当工业工程师介入时，分析二者间的联动机制——如教务系统反馈数据如何优化教室分配效率。"
            },
            {
                "title": "工业工程改进的核心活动",
                "content": "2.3节强调流程优化是提升组织效率的首要活动。具体案例分析：某大学工业工程师可通过动态调整实验室使用排程（消除空闲时段）或重构选课算法（降低冲突率实现资源最大化利用）。需同步建立数字孪生模型验证优化方案的实际效果"
            },
            {
                "title": "系统工程绩效指标体系案例",
                "content": "基于2.6节理论延伸的详细指标包括：设备综合效率（OEE）达到90%、跨部门流程合规性偏差不超过5%、课程表冲突率降至0.3%以下、项目进度偏差控制在±3天范围内。特别设置'师生满意度指数'等质性指标，形成360度评估体系"
            },
            {
                "title": "温度调节系统的逻辑建模",
                "content": "对于住宅温控需求，图2.6可转化为：传感器采集当前室温T_act,比较器计算与设定阈值L/H的偏差，控制器输出加热/制冷信号，最终使稳态误差保持在2.5%以内。需特别标注延迟因素（如空调响应滞后）对调环的影响"
            },
            {
                "title": "导弹制导系统的工程映射",
                "content": "制导问题转化为包含三环控制的架构：外环导引律生成加速度指令，中环姿控稳定弹体姿态，末段红外成像匹配实现CEP≤20ft。强调卡尔曼滤波对减小初始误差的关键作用"
            },
            {
                "title": "淋浴恒温系统的动态平衡",
                "content": "该案例突显人机混合系统特征：用户通过体感反馈调节热水阀开度，理想状态下应建立闭环传递函数，量化温度波动与阀位调整的微分关系。实测数据表明需要0.8Hz以上的调节频率才能抑制±2℃的振荡"
            }
        ]
    },
    {
        "summary": "本章讨论了金属加工工艺以外的多种工艺流程和工业工程的相关概念。产品设计与生产工艺设计之间存在交互作用，这种交互作用是必需的以确保设计的可生产性。金属加工的基本类型包括剪切、车削、钻孔等。生产/制造工程通常被认为是工业工程的一部分，因其关联性紧密值得辩护。拉丝和冲压杯形物件的区别在于加工方式和应用场景的不同。铜焊和锡焊因其高效和精确而在电子工业中得到广泛应用。夹具和卡具是生产中的重要辅助工具，用于提高加工精度。应急维修和预防性维修各有其适用场合，关键在于针对场景选择合适方法。人工智能在产业生产中的应用广泛，提升自动化水平。而集成的自动化孤岛则体现单一系统的独立性与高效性。",
        "example": [
            {
                "title": "其他工艺流程列举",
                "content": "工业和政府部门中除金属加工外的工艺流程涉及塑料加工、垃圾回收、废料掩埋、化工生产、木材加工、食品加工、纺织生产、半导体制造、纸张生产、陶瓷加工和制药行业等十个领域。"
            },
            {
                "title": "金属切削作业的示例",
                "content": "诸如剪切、车削、钻孔、铣削等金属加工作业，其中剪切用于板材裁切，车削适用于转体的加工细节如汽车轴部件制作，钻孔用于生成精密孔径如工业装配，而铣削则能实现复杂轮廓如机器部件制作。"
            },
            {
                "title": "夹具和卡具示例",
                "content": "例如，生产线上使用的夹紧夹具用于稳固金属板材于工作台上；卡具可以是用来精确对位的固定结构，确保机械部件组装时的准确位置。"
            }
        ]
    },
    {
        "summary": "本章涵盖了一系列工程和生产流程图制作的实践练习，重点介绍了流程规划、物料清单（BOM）的绘制和成本计算的方法。具体的练习包括：草莓冰淇淋的配制流程（需绘制工艺程序图）、书柜等产品的物料清单绘制、胶合板加工路线设计、FORTRAN程序编写以计算产品成本、及使用该程序或手工计算方法对给定零件列表的总成本计算（含直接人工和管理费用）。这些练习旨在增强学生对生产过程中材料、工艺和成本控制的理解和实践能力。其中涉及的具体操作包括食材的混合加热、金属或木质产品的加工路径设计、以及计算机程序在生产工程中的实际应用验证。",
        "example": [
            {
                "title": "草莓冰淇淋配制流程",
                "content": "一杯白糖、一包冷冻草莓(一杯半)、两鸡蛋、一包草莓酱、一罐炼乳经融化、过滤（得3/4杯汁）后，与糖、蛋混合煮沸1分钟，加酱冷却。加入草莓和打发起泡沫的冷牛奶后，倒入蛋奶薄饼模，冻存。"
            },
            {
                "title": "书柜物料加工路线设计",
                "content": "假定用锯子切割4ft×8ft胶合板为侧壁和架板，用胶水、2in圆头木钉组装，旋臂锯开榫槽，外购螺钉和贴花纸，无需计算时间或成本。需绘制各零件的加工路径图。"
            },
            {
                "title": "FORTRAN程序计算产品总成本",
                "content": "程序需基于部件直接材料、人工费用及固定比例管理费用（135%）计算单位总成本。例如零件A-H的费用表：A(1, $1, $5)、B(2, $2, $1)、C(1, $1.5, $0.5)等，装配费$5/件。"
            },
            {
                "title": "汽车清洗流程优化",
                "content": "现有流程包括准备海绵、桶、胶管和肥皂，检查是否可改进。需绘制工艺程序图并提出优化方法。"
            },
            {
                "title": "金属零件生产图表实践",
                "content": "选一金属件，绘制其物料清单、工艺程序图和虚构机器编码的加工路线单，应用书中方法。"
            }
        ]
    },
    {
        "summary": "布局与作业顺序一致确保了流程的顺畅和合理，减少了在制品库存。单位产品的生产时间短，降低了物料搬运成本。生产线操作简单，培训时间和费用较少。这种布局使得生产计划和控制系统变得简单，减少了运输和存储过程中产品所占用的空间。",
        "example": []
    },
    {
        "summary": "本章重点介绍了物体电磁现象的成因在于电荷及其运动，以及电荷的量子性和守恒性。电荷分为正负两种，同种相斥，异种相吸。电子带负电荷，质子带正值，中子不带电。电量为$e=1.602\\times10^{-19}\\,C$，这一基本量通过富兰克林的命名法延续至今。质子和中子内部的不同电荷分布揭示了它们的基本特性，质子的正电荷集中在小半径空间内（$10^{-15}\\,m$），而中子内部的电荷相互抵消。微观带电体的特性如氢分子和氮原子的电中性证明了电荷与其运动状态无关，这被称为电荷的微观不变性。另外，实验证明了电荷的局部守恒性，即系统中电荷的代数和不变，正负电荷的产生或湮灭不影响全局守恒性。电荷还具有相对论不变性，其电量不受观测者的运动状态影响。",
        "example": [
            {
                "title": "物质结构的电荷分布",
                "content": "质子和中子的内部结构分别图示了不同的正负电荷分布：质子的电荷仅含正的且密集于一个小体积（$\\sim10^{-15}\\,m$内）；中子则为外围负电荷包围内层正电荷的分布形式使其呈现电中性。"
            },
            {
                "title": "电荷量子化验证",
                "content": "密立根油滴等实验直接精确测算了单一电子携带的基本值$e=1.602\\times10^{-19}\\,C$，同时斯通尼等人确立电解现象中带电粒子所带皆为$e$正负整数倍。"
            }
        ]
    },
    {
        "summary": "生产线的故障、产品设计变更、设备利用率不足等问题都会对生产效率产生显著影响。一台机器故障可能导致整个生产线停工；产品设计变动会引发布局较大调整；生产速度受限于最慢的机器环节；现有的生产监督机制缺乏专门性；投资需求较高，因为需要配备大量相同机器（部分利用率不足）。",
        "example": [
            {
                "title": "机器故障导致停产",
                "content": "一台机器出现故障，可能导致整个生产线的停工。"
            },
            {
                "title": "产品变更引发布局调整",
                "content": "由于布局是根据产品进行设计的，所以产品设计一旦变动，就需要对布局进行较大改动。"
            },
            {
                "title": "均衡生产效率问题",
                "content": "生产速度是由最慢的机器决定的。"
            },
            {
                "title": "缺乏专业监督",
                "content": "监督只是一般性的而非专门性的。"
            },
            {
                "title": "设备利用率不足",
                "content": "比较而言需要较大投资，因为有时许多同样的机器（有些并未得到充分利用）需要沿生产线分布。"
            }
        ]
    },
    {
        "summary": "电荷的种类、性质及其量子性是电磁现象研究的基础。电荷分为正负两种，电子带负电，质子带正电，中子不带电。电量以库仑为单位，表示为 Q 或 q，正负电量的代数和决定带电体的总电量。电荷的量子性表明电荷是电子电荷量 e 的整数倍，e的值为 $e=1.602\\times10^{-19} C$。这一特性通过电解实验和高能粒子碰撞等现象得到验证。质子和中子内部的电荷分布通过高能电子散射测定：质子带正电荷集中在半径为 $10^{-15} m$ 的体积内，中子对外不显电性。近代物理发现夸克可能携带分数电荷，但尚未被直接观测到。点电荷概念的适用性取决于带电体相对研究距离的尺度，电子和质子等微观粒子常被视为点电荷。",
        "example": [
            {
                "title": "高能电子散射实验",
                "content": "通过高能电子束散射实验测出的质子和中子内部的电荷分布分别显示质子带正电荷集中在半径约为 $10^{-15} m$ 的体积内，中子内部有正负电荷，净电荷为零。"
            },
            {
                "title": "密立根油滴实验",
                "content": "1913年密立根的油滴试验，直接测定了电子电荷的量值，确认基元电荷e的大小为 $1.602\\times10^{-19} C$。"
            },
            {
                "title": "氢分子与氮原子的电中性比较",
                "content": "实验比较氢分子和氢原子的电中性，两者内部正负电荷在数量上的差异可忽略不计，证实质子的电量与运动状态无关。"
            },
            {
                "title": "电子对的产生与湮灭",
                "content": "高能光子转化为正负电子对（产生）或正负电子消失产生光子（湮灭）的例子，证明了电荷守恒定理在各种微观过程中的应用。"
            }
        ]
    },
    {
        "summary": "任务组织方式的特定安排带来了几个重要的优点：首先，通过更高效的机器利用减少了对机器数量的需求；其次，在工作分配时设备和人力的调配具有高度的灵活性；第三，机器投资的成本相对较低；第四，多样性的工作任务为操作者提供了更高的工作满意度和职业兴趣；最后，这种组织方式使得专门的监督成为可能。",
        "example": []
    },
    {
        "summary": "本章主要内容集中于讨论与工厂布局和设施选址相关的费用、技术与方法。首先讨论了工厂布局对各种费用项目的影响及其发生机制。然后比较了扩大规模式布局设计与重新布局设计的区别。接下来重点讨论了工厂选址的分析技术及其在实际决策中的作用和优缺点。随后涉及了距离测量方法（直交线式和欧几里得式）的不同适用场合，并列举了三种基本布局方法及其应用实例。同时也讨论了启发式求解方法与最优求解法的区别，以及产品、工艺和固定位置布局各自的优劣势。此外，本章还介绍了计算机布局软件中的建设型与改良型程序、选址决策过程的两个层次，以及不同部门选址问题的差异。最后总结了计算机布局设计和评价的优点，讨论了设施布局与选址的相似性与差异，并举例说明了需要考虑原材料与顾客就近性的选址决策问题。",
        "example": [
            {
                "title": "直交线式和欧几里得式距离测量方法的适用场合举例",
                "content": "直交线式距离测量方法适合用于城市街区的路线规划，而欧几里得式距离测量方法更适用于直空距场合，如航空路线的设计。"
            },
            {
                "title": "选址目标实例",
                "content": "例如一个配送中心选址可能以最小化所有运输路线总长度为主要目标（总运输距离最短）；也可能关注最远客户的响应速度（最大运输距离最短）。"
            },
            {
                "title": "非制造业企业的布局影响案例",
                "content": "医院科室布局影响患者流动效率；购物中心商家分布影响顾客购物体验；机场登机口安排影响旅客周转时间。"
            },
            {
                "title": "靠近原材料供应地与客户的不同例子",
                "content": "炼油厂通常布局在原油产区附近以减少原料运输成本（靠近原材料）；而面包房则通常靠近居民区以便保持产品新鲜度（靠近顾客）。"
            }
        ]
    },
    {},
    {
        "summary": "本章阐述了物料搬运的定义及其在工业中的重要性，物料搬运的多样化工具种类及其各自的应用实例，19条物料搬运原则及其实际应用，工厂布置研究中减少物料搬运费用的原因，旅行推销员问题的求解方法及实用实例，手工解法与计算机解法在不同场景的优劣对比（手工法通常可获得相同的结果，有时候更优），运输问题如何转化为指派问题，以及一种不同于Clark-Wright法的测量方式（S = d_{0i} - d_{ij} 或 S = d_{0j} - d_{ji} 适用于单向差异）。这些内容和原则可以帮助学习者理解如何优化物料搬运流程及决策。最后还有一个作业要求绘制特定物资的循环示意图。",
        "example": [
            {
                "title": "物料搬运的工具分类样例",
                "content": "托盘车用于室内货物的短距离移动，吊车用于重型物体的垂直移动。"
            },
            {
                "title": "19项物料搬运原则及例证",
                "content": "例如“保持运输单元的移动连续进行”原则可通过自动化立体仓库实现。"
            },
            {
                "title": "旅行推销员问题的应用场景",
                "content": "物流配送路线设计和邮局信件分发路径规划均展示了该算法的实际应用价值。"
            },
            {
                "title": "Clark-Wright替换计算方法",
                "content": "采用S = d_{0i} - d_{ij} 作为节约值计算方法可应对不对称距离的场景需求。"
            },
            {
                "title": "货物循环示意图",
                "content": "作业要求描绘铝罐从原材采集、生产灌装、配送到回收再生的完整闭合流程图示。"
            }
        ]
    },
    {
        "summary": "1. 一个工厂需要从不同的停放地点（A、B、C、D）运输叉车到需求地点（X、Y、Z），距离（费用）矩阵已给出；2. 练习题1可构造为分派问题，求解结果与运输规划问题的解相比较；3. 工具室的一辆叉车需要服务多个地点（机械车间、油漆车间、原料仓库、成品仓库），形成一个旅行推销员问题，需计算最短行驶距离；4. Ace公司每天从中央仓库派遣卡车到其他仓库，需确定车辆数目和路径；5. 台架库存问题，需将库存分配到多个需求地，成本矩阵已给出；6. 如果目的地的需求发生变化（如增加），再次求解台架库存运输问题；7. 假定可用的卡车数量和装载量变化，重新确定最佳发货路线；8. 仓库和供应点的距离为已知值，构造并计算最短运输距离；9. 根据本地报纸上标识的现场旧货出售点构造旅行推销员问题并运用启发式算法求解。",
        "example": [
            {
                "title": "多个车辆的调度及路径优化（练习题1）",
                "content": "一个工厂有多个叉车停放地点（A、B、C、D），需要把它们运输到需求地点（X、Y、Z），已知运输的距离及费用矩阵。运输规划问题可以用最小费用法求解（如线性规划或网络流算法）。"
            },
            {
                "title": "工具室专用叉车的最短行驶（练习题3）",
                "content": "一辆叉车需要服务多个地点（机械车间、油漆车间、原料仓库、成品仓库），起点为工具室。根据各点之间的移动距离，可构造类似于旅行推销员的问题（从A出发→到达B→…→A），需计算其完成所有任务并返回的最短行驶行程。"
            },
            {
                "title": "有限装载量的卡车配送（练习题4）",
                "content": "已知仓库每天的送货路径可能涉及多个仓库和每辆车的容量限制 (6000单位/次)。确定需要发送的车辆数以及各车应经过的配送点的路线组合，目标是最小化总的发车行驶路程。"
            },
            {
                "title": "货物调运中的运费最少（练习题5和6）",
                "content": "各库存地的可用台架数量与各目标需求的分配，构造运输问题（线性规计划或匈牙利算法），优化基于单位运费的费用最低分配方案。若需求量发生变化（如题6中的台架需求量增为100），再次计算最优分配方案。"
            }
        ]
    },
    {
        "summary": "本章主要讨论工作测定、生产率测定和组织系统绩效测定的定义及其相互关系。工作测定涉及任务时间的测量，而生产率测定关注输出的输入比率。组织系统绩效测定比生产率测定更广泛，包括效率、效果、质量等更多维度。介绍了静态和动态生产率指标的区别，动态指标更适合衡量长期改进效果。工作设计中利用了工具如五步研究法和流程图来简化工作方法。标准时间及其组成要素（正常时间、宽放时间等）被定义，并提供了直接时间研究和预定时间标准法等方法的应用。最后讨论了大学和酒吧等不同环境下绩效指标的选择和应用问题。",
        "example": [
            {
                "title": "Ajax 制造厂的生产率测定指标",
                "content": "Ajax 制造厂生产木质小桶，该工厂可能采用的局部生产率测定指标包括：每小时生产的木质小桶数量（效率）、每吨木材生产的小桶数量（资源利用率）、每单位能量消耗生产的小桶数量（能源效率）。作为复合指标可能是每单位劳动力和资源投入生产的小桶数量（综合生产率）。 Kentucky 州和 Tennessee 州可能采用运输效率或市场需求满足率等局部指标，同时可能考虑环境影响的复合指标。"
            },
            {
                "title": "延期交货单的设计流程",
                "content": "设计延期交货单的流程中，库存耗尽时发出延期通知，当有货时自动运送给客户。此过程可以采用流程图工具来显示各环节的依赖性，减少不必要的处理步骤。"
            },
            {
                "title": "NGA技术在选择生产力指标中的应用",
                "content": "名义小组技术（NGT）能有效收集小组创意并投票选择最优化的生产率指标从而有效达成共识。例如，在讨论过程中每位成员独立列出可能选项，然后集体讨论最后进行投票排名，确保每位成员参与同时结果被公正接受。"
            },
            {
                "title": "Eskimo Mike's 酒吧的绩效指标",
                "content": "针对Eskimo Mike's，效率指标可以是每小时服务的顾客数量；服务质量可以通过顾客满意度调查来衡量；财务绩效可以通过啤酒和混合饮料的销售总额来监测。"
            }
        ]
    },
    {},
    {
        "summary": "控制系统的要素包括输入、处理过程、输出、反馈和控制机制。输入是系统接收的信息或资源，处理过程是将输入转换为输出的活动，输出是系统的最终产品或服务，反馈用于测量输出并与目标进行比较，控制机制则根据反馈调整输入或处理过程。这些要素共同作用形成一个闭环系统，确保系统按照预期运行并实现目标。\n\n生产（运作）计划与控制的5个基本职能包括预测、计划、排程、执行和控制，它们相互依存以确保高效运作。管理层愿意投入资金以获取准确的需求预测，具体投入取决于预测精度对业务的影响。预测技术的选择应根据数据的可用性、问题复杂度和时间跨度来决定。生产计划的基本目的是高效利用资源，确保按时交付产品以满足需求。生产计划侧重于长期和战略层面的决策，而生产作业计划则是具体的短期实施细节。生产作业计划的目标包括资源的优化利用和订单的准时完成。没有进度控制职能的公司可能导致资源浪费、交货延迟和客户满意度下降。",
        "example": [
            {
                "title": "生产运作计划职能的应用",
                "content": "章节讨论了如何将生产（运作）计划的5个基本职能（预测、计划、排程、执行和控制）相互依赖地运用于各种实际场景，如医院的病床管理、银行的服务队列优化等。"
            },
            {
                "title": "预测技术在不同情境的选择",
                "content": "如何根据数据的类型、问题的复杂性以及预测的时间跨度，在不同行业中（如制造业、服务业等）选择合适的预测方法，例如时间序列分析或因果模型。"
            },
            {
                "title": "控制系统要素的实际应用",
                "content": "通过具体案例说明了控制系统要素如何应用于职业足球队的训练计划和比赛策略调整中，通过反馈机制优化表现和战术。"
            },
            {
                "title": "无调度与进度控制的潜在后果",
                "content": "讨论了在某制造公司中缺乏调度和进度控制职能的情况下，如何导致生产混乱、成本增加和市场份额下滑，强调进度控制的重要性。"
            }
        ]
    },
    {
        "summary": "本章内容涉及供应链管理中的预测、生产规划和库存控制三部分主要内容。预测章节包含了对X型（400-440单位）和Y型（70-160单位）超级配件各12个月的需求预测（通过表格数据），并提出了3种预测方法的选择依据及促销活动对需求的阶段性影响（+20%/15%/10%，随后-10%/-5%回归正常）。同时讨论了36个月历史销售数据的波动特征（67-132单位）及其影响因素。在生产计划章节中要求制定三种可行的生产分配方案（X型和Y型），分析生产计划评估标准和方法，并引入5个生产部门（各5-20单位工时/部件）与10%废品率等现实约束。库存管理部分包含计算4类外购零件的最佳订货量（典型模型及修改建议）以及与EOQ模型（单品种1000件，10美元订货费，0.5美元年储存费下建议批量为200件）相关的三种应用情境。最后通过产品层级结构图（SA1→C1,C2;C2→C3等）展示了物料需求计划（MRP）的多级计算逻辑，并包含设计变更（C2替代C4）对系统的动态影响分析。",
        "example": [
            {
                "title": "X型与Y型产品促销需求预测",
                "content": "营销部门从4月开始对X型产品促销：首月+20%、次月+15%、第三月+10%；随后第四月-10%、第五月-5%、第六月恢复正常。需据此调整6个月的预测值，例如原4月370件变为370×1.2=444件。"
            },
            {
                "title": "36个月需求数据的规律分析",
                "content": "需求数据呈季节性波动（1-6月较高，7-9月低谷，10-12月回升），极端值为67单位和132单位。12个月预测需考虑趋势与周期成分组合。"
            },
            {
                "title": "多部门生产计划约束",
                "content": "5个部门生产X型（5-20工时）和Y型（5-10工时）的工时差异显著，加之部门2废品率5%、部门4仅1%，导致计划需平衡效率和废品损失。"
            },
            {
                "title": "EOQ模型计算案例",
                "content": "年需求1000件，订货费10美元/次，储存费0.5美元/件·年，计算得出经济批量Q=√(2×1000×10/0.5)=200件，年订货5次，间隔50工作日（250天/5）。"
            },
            {
                "title": "MRP多级计算实例",
                "content": "依据P3的主计划（9-11周需30/20/25件），反向推算C1-C4的需求量。已有16件C4库存和12件在途C1，需在第4周调整采购。图示SA1→C1/C2→C3结构需分层展开计算。"
            }
        ]
    },
    {
        "summary": "本章讨论了质量的全面定义和质量管理的重点转移，从生产者转向顾客的原因，强调了多个领域协调的重要性，并不局限于生产领域。质量下降的影响包括市场份额减少和生产率降低。注册过程中的资源浪费问题被提上日程，强调了时间是关键指标。大学校园内的顾客和供应商身份以及两者可能的交叉点被识别出来。质量三部曲被详细阐述——质量计划、质量控制和质量改进的区别及其背后的命名者。通过实际案例说明了离线质量控制和在线质量控制。根据个人经历举例内外部疏忽成本，并讨论了使用流程图和因果关系图的益处。变量间的相关关系通过散布图进行分析，挑战了将质量控制人员解雇的简单做法是否能降低质量成本。讨论了特性数据和变量数据的区别，解释了统计过程控制（SOSC）的含义及其产品合格率的问题。篮球比赛中的普遍和特殊因素被分析，失控状态下生产合格产品的可能性也在探讨。p图相比传统的均值和极差控制图的选择也被阐述，最后以c图适用的数据实例作为章节收尾。",
        "example": [
            {
                "title": "大学注册过程的资源浪费",
                "content": "站在学生的立场上，评估大学注册过程中的等待时间损失等资源浪费问题，并以时间来量化浪费的具体情况。例如，学生可能需要等待长时间进行课程注册，导致时间和精力的浪费。"
            },
            {
                "title": "内外部疏忽成本的实际例子",
                "content": "基于个人工作或学习经历，提供内部疏忽成本如生产延误导致的额外加班费和外部疏忽成本如顾客退货导致的退款费用的例子。"
            },
            {
                "title": "散布图中几种相关的变量关系",
                "content": "举例变量关系，例如正相关如气温与冰淇淋销量，负相关如汽车轮胎磨损度与行驶安全性，不相关如个人名字长度与薪水高低。"
            },
            {
                "title": "篮球比赛中的普遍与特殊因素",
                "content": "提出篮球比赛中的普遍因素例如团队配合默契度、教练的策略指导和球员体能状况；特殊因素则可能是比赛当天的天气、个别球员临场竞技状态、观众支持度的影响。"
            },
            {
                "title": "适合用来绘 c 图的例子",
                "content": "收集一定时间段内工厂生产线上产品尺寸与产品缺陷数量的关系，因为c图主要用于计数缺陷数目的情况。"
            }
        ]
    },
    {
        "summary": "章节内容主要包括了一系列与质量控制、统计分析相关的练习题和应用实例。主要内容包括：1）注册过程的流程图制作；2）因果关系图分析个人关系的冲突原因；3）使用排列图分析缺陷数据，分类方式包括打包机编号、缺陷类型和时间单位；4）制作柱状图和散布图，分析中心与分布的关系，以及变量之间的相关性；5）电镀操作中电镀时间与厚度关系的图表分析；6~9）在样本数据上应用均值（$\\bar{X}$）和极差（$R$）控制图进行评估和分析；10~12）自然波动和能力评估，确定控制界限；13）不合格品数的p控制图应用；14）工装裤工艺缺陷数据的c控制图分析。所有这些方法旨在通过图形和统计分析来识别趋势、关联和控制质量问题。",
        "example": [
            {
                "title": "注册过程改进的流程图",
                "content": "1. 给学生所在学校的注册过程作一个流程图，清楚地表明任何一个需要改进的领域。"
            },
            {
                "title": "情侣争吵因果关系图",
                "content": "2. 作一个因果关系图，说明你和你的男朋友 (女朋友或配偶) 之间为什么会有争吵。"
            },
            {
                "title": "电镀厚度与时间关联分析",
                "content": "6. 在电镀操作中一般认为电镀层厚度与电镀时间有关。实验数据显示时间在2h到12h，厚度在60 x 10^-6 in到110 x 10^-6 in之间。"
            },
            {
                "title": "瓶子罐装重量的$\\bar{X}$和$R$控制图",
                "content": "7. 从瓶子罐装工序中抽取20个容量为$n = 4$的样本组数据，分析每瓶的重量超过16 oz部分的趋势。每个样本组的样本均值($\\mathbf{X}_i$)和极差($\\mathbf{R}_i$)进行了统计。随后对这20组数据进行$ \\bar{X} $图和$ R $图的中心线、控制界限计算与结果评估。之后再绘制剩下的10组数据，并进行标记与分析工序结论。"
            },
            {
                "title": "生产线工序能力评估",
                "content": "9. 基于40组大小为$n = 5$的样本数据进行工序能力分析。计算了极差的总和$\\mathop{\\sum }\\limits_{{i = 1}}^{{40}}{R}_{i} = {930}$和均值总和$\\mathop{\\sum }\\limits_{{i = 1}}^{{40}}\\overline{{X}_{i}} = {300}$，结合极差与均值的最大值和最小值，判断工序状态是否可控制。并对技术规范界限进行了讨论。"
            },
            {
                "title": "不合格品控的p控制图",
                "content": "13. 电子工业中压印生产的26个样本中不合格品数据的收集与处理。每个样本大小为200个压印件，记录了每个样本的缺陷数量。为这些数据作了$p$控制图并分析。"
            },
            {
                "title": "工装裤生产缺陷c控制图",
                "content": "14. 记录与分析了20捆工装裤加工过程中被发现的不合格点的数量。每个捆由18条工装裤组成，数据用于生成和分析$c$控制图以优化缝制工艺的质量。"
            }
        ]
    },
    {
        "summary": "本章涵盖了工作分析及报酬体系中的关键概念及工具：1) 区分了工作、任务和岗位——工作是职位的集合，任务是工作的基本活动，岗位是具体职位；2) 工作描述和工作规范可用于招聘、绩效评估和培训；3) 问卷调查法因依赖主观回答，精度不如能直接记录行为的观察法和可深入追问的面谈法；4) 编写工作描述和规范能明确职责和任职要求，确保人岗匹配。工作评定方法中要素比较法/分级法与标准对照（第5问）。队列法适合同类工作简单排序（第6问），团队奖励比个人奖励更适合协作性工作（第7问）。电话访谈法适用于预算有限时（第8问），Scanlon计划强调成本节约而非利润分配（第9问）。团队奖励对满意度提升最有效（第10问）。",
        "example": [
            {
                "title": "问卷调查法的局限性",
                "content": "为什么工作分析的问卷调查法不如观察法和面谈法准确?——因问卷依赖被调查者的记忆和主观表述，而观察法能记录实际行为，面谈法可实时追问细节。"
            },
            {
                "title": "分类法应用场景",
                "content": "当存在现成职位等级体系（如政府职级）时，分类法可快速将新职位归入既定类别（第6问）。"
            },
            {
                "title": "Scanlon计划特点",
                "content": "Scanlon计划通过员工提案降低生产成本并分享节约金额，区别于利润分享计划的分红模式（第9问）。"
            }
        ]
    },
    {
        "summary": "本节内容涉及多个与工资计算和工作规范的实用问题。首先，需要编写一份学生宿舍舍监或宿舍顾问的工作描述或工作规范。其次，介绍了如何使用分级打分法为新工作——机械操作工——确定近似小时工资，给出了不同评价因素的等级和对应工资。第三个问题是关于计件工资制和标准工时制下的工资计算，包括标准工时制下的‘赚得的时间’。第四个问题利用因素比较图决定复弧焊接工的工资范围。接着的问题是时间研究、计件工资计算和工资曲线的绘制，宽放率为12%，每小时工资12美元。还包括了宿舍舍监的工资评定计算题、编写大学系主任的工作描述和足球主教练的工作描述的习题。最后，一个关于团队奖励计划（Scanlon 计划）的问题，包含分享利润的百分比、员工奖励储备金和即付奖金的计算。",
        "examples": [
            {
                "title": "机械操作工的工资确定",
                "content": "表 9.7 的分级打分法用于确定机械操作工的近似小时工资。"
            },
            {
                "title": "计件工资核算",
                "content": "在基本工资标准为60件/h，保证基本工资为每小时8美元的情况下,工人生产520件产品在8小时内,计算两种工资制度下的工资。"
            },
            {
                "title": "复弧焊工工资范围",
                "content": "因素比较图展示了新工作复弧焊工的工资范围，与其他已有薪资等级的旧工作对应分析而得。"
            }
        ]
    },
    {
        "summary": "本章讨论了自动化、数字控制、机器人和柔性制造系统在现代制造业中的应用及其未来趋势。主要内容包括可编程控制器在先进制造设备中的应用，数字控制概念的最新发展，常用数控编程语言的比较分析，以及机器人在生产系统中的多样化用途及其比例分析。还涉及了制造系统中工人与机器人共存时的管理问题，语音输入和机器视觉的未来应用潜力，以及机器人在非制造业中广泛使用的可能性。此外，探讨了柔性制造系统的理论基础、CAD/CAM与自动化的关系、办公自动化在工业工程中的重要性、成组技术的核心理念以及传统工作分析方法在工业机器人工作任务描述中的适用性问题，并通过医院机器人应用的例子探讨了自动化技术在医疗行业的可行性。",
        "example": [
            {
                "title": "工业机器人应用场景分析及比例预测",
                "content": "12页问题4要求对机器人的各种用途进行文献综述，分析现有机器人类型的市场比例结构，并预测10年后这种比例结构的变化趋势"
            },
            {
                "title": "医院服务机器人应用可行性研究",
                "content": "12页问题14提出实际调研当地医院，探讨在清洁餐具（放入洗碗机）和为病人分装配送膳食等场景中使用机器人的可行性"
            },
            {
                "title": "工业与服务业应用展望辩论",
                "content": "8页问题8引发关于5年内机器人是否会广泛部署到非制造领域的论断，要求提供实证支持这个预测性的结论"
            }
        ]
    },
    {
        "summary": "这一章节探讨了人类与机器行为特性的比较，区分了人类行为的生理学和心理学特性，并通过家具设计的实例来讨论尺寸合理性。此外，章节提出了设计工科学生完美工作场所的建议，回顾了质量研究小组和工业企业人机界面设计的历史发展，并对未来机器人和人因工程的重要性提出了展望。同时，章节还讨论了组织结构革新的问题，质疑层级式组织是否已经过时。这些话题均涉及到人机交互、人因工程、心理学和工业设计等多个领域，结合了理论与实践的研究。",
        "example": [
            {
                "title": "家具尺寸设计合理性研究",
                "content": "仔细研究你公寓或宿舍里的家具, 特别是家具的实体尺寸, 推测每件家具的尺寸是怎么得来的, 你认为这些尺寸在 20 世纪 90 年代和 21 世纪前 10 年都合适吗?"
            },
            {
                "title": "学生宿舍工作场所设计",
                "content": "运用本章中介绍的基本思想在学生宿舍中为工科学生设计一个完美的工作场所。"
            },
            {
                "title": "质量研究小组文献综述",
                "content": "做一个有关“质量研究小组”的文献综述, 追溯这项活动的发展历程并且给出你的结论和建议。"
            },
            {
                "title": "人机界面设计文献综述",
                "content": "做一个有关工业企业人机界面设计方面的文献综述, 给出你的结论。"
            },
            {
                "title": "机器人行为特性推测",
                "content": "通过查询图书馆的文献资料, 推测到 2010 年机器人会在多大程度上具有人的行为特性。"
            }
        ]
    },
    {
        "summary": "工业工程师参与能源、水和危险品管理的问题，因为这些问题涉及多学科交叉，包括机械、化学、电力和土木工程等，需要通过系统工程方法来优化资源使用和安全性。OSHA、DOT和EPA介入危险材料管理领域，因为它们各自负责职业安全、运输安全和环境保护，共同监管危险材料的处理、运输和排放。电压水平1虽然便宜，但需要公司自备变压器，增加了设备成本和维护负担。电力需求在7月达到高峰，而冬季需求较低但仍需支付最低用量费用，这种模式导致夏季运营成本高，冬季资源利用率低。尽管有人认为能源危机已经过去，但能源管理仍然是必要的，以减少资源和成本的浪费，并优化运营效率。",
        "example": [
            {
                "title": "电压水平1的自备变压器弊端",
                "content": "在图12.2中，电压水平1虽然较便宜，但公司必须自备变压器。这不仅增加了公司的设备购买和维护成本，还可能因变压器的故障或不匹配导致运营中断。"
            },
            {
                "title": "峰谷电力需求模式的利弊",
                "content": "公司的电力需求在7月出现高峰需求，远高于最低用量限额，需要支付高昂的成本；而在11月至4月期间需求低于最低用量限额，却仍需支付最低用量费用，导致资源不充分利用。"
            },
            {
                "title": "危险材料管理的监管",
                "content": "OSHA负责职业安全与健康管理，确保职业安全；DOT负责危险材料运输的管理；EPA负责控制危险材料释放对环境的影响。三者共同参与管理危险材料问题，以保证从生产、运输到处理的整个过程的安全性。"
            },
            {
                "title": "能源管理的必要性",
                "content": "尽管有人认为能源危机已过，但实际上通过能源管理可以实现优化资源利用率，减少浪费(某些公司甚至减少了50%以上危险废物产生)，并降低相关成本。"
            }
        ]
    },
    {
        "summary": "本章内容主要讨论了不同公司在能源消耗和管理方面的几个具体案例，涵盖了天然气消耗、电能使用、水资源再利用、能源管理项目等多个方面的成本和节约分析。案例涉及Ajax公司的天然气消费成本分析、电能费用优化决策、Ace公司的水资源再利用与热能回收、Zebra Stripes公司的综合性能源管理项目设计、Inden公司的照明系统升级以及工厂废弃溶剂回收利用的经济效益分析。每个案例都通过具体数据进行量化比较，重点展示了通过不同方式（例如优先级选择、设备升级、资源再利用和回收系统）来降低能源成本和环境影响的可行策略。",
        "example": [
            {
                "title": "Ajax公司的天然气消费成本分析",
                "content": "Ajax制造公司在不同优先级下的天然气月度消费分别为1000 MCF和3000 MCF时，按照费率图12.1计算对应的成本并推荐最优方案。"
            },
            {
                "title": "Ajax公司的电能费用优化决策",
                "content": "Ajax公司考虑购买变压设备将电力等级从水平2降低至水平1，计算初始投资回报率是否满足3年内回收的标准，并包含300美元/月的设备维护费用。"
            },
            {
                "title": "Ace公司的水资源再利用与热能回收",
                "content": "Ace公司压缩机每年使用3×10⁶加仑水进行冷却，水从65°F加热至105°F后可通过加热器水箱回收热能，评估节省的水费和天然气费用（水价2美元/10³加仑，天然气5美元/10⁶BTU）。"
            },
            {
                "title": "Zebra Stripes公司的能源管理项目",
                "content": "Zebra Stripes公司支付每年150万美元的天然气和电力费用，提出对其三个独立制造中心的能源消耗进行监测和改进的具体方案，以降低能源开销。"
            },
            {
                "title": "Inden公司的照明系统升级",
                "content": "Inden公司将100个1000瓦水银灯替换为400瓦高压钠灯，基于每月400小时的使用时长和电费构成（6美元/kW峰值需求+0.08美元/kWh消耗）核算月度成本的节省情况。"
            },
            {
                "title": "工厂废弃溶剂的回收处理评估",
                "content": "工厂每月10,000公斤废弃溶剂的焚烧处理费为0.07美元/磅，与回收方案（0.05美元/磅处理+0.2美元/磅新材料）对比，通过90%回收率和节约新溶剂用量，分析净节省金额。"
            }
        ]
    },
    {
        "summary": "本章主要讨论工业工程师（IE）与会计学的关系，特别是成本会计和管理会计在IE工作中的重要性。工业工程师比普通会计师更关注成本会计，因为其专注于生产成本分析和流程优化，而工程师需在职业生涯早期参与会计相关研讨班以掌握基本会计知识。会计基础核心概念包括资产、负债、所有者权益、收入、费用（直接材料、直接人工、管理费用），其中直接人工和材料可直接追溯至产品，管理费等则称为间接成本。举例说明成本分类：处理零件的工人时间（直接人工），航空器板材（ 直接材料），维修工人时间需分类（4）中为间接成本。文中强调资产负债表与损益表的关系：损益表反映的净利润影响所有者权益，从而使两者保持平衡。在制造业与服务行业中，各类管理费用的确认需要分摊方法解决常见包括直接法和交互法。工程师还需在项目投资管理中利用财务公式如现值（P∣F）、终值等衡量项目收益，其中年末与年初现金流差异需调整计算。资金时间价值的重要性体现在长期经济分析中。实际应用和案例将帮助理解和运用这些复杂金融与会计工具。",
        "example": [
            {
                "title": "成本会计项目示例",
                "content": "(1)直接加工产品零件 ( 直接人工)\n(2)裁剪航空器的支撑板（ 直接材料）\n(4)工厂生产多产品的工序用维修工( 间接人工 )"
            },
            {
                "title": "公司财务分析的练习",
                "content": "第五题要求实际查阅资产负债表和损益表，对比净收益与所有者权益的相互关系"
            },
            {
                "title": "金融公式的实际案例",
                "content": "第八题中的五个财务公式，如（F∣A），（A∣P）等可在工程经济学教材中找到具体运用"
            }
        ]
    },
    {
        "summary": "本章内容涉及多个财务会计和投资回报的基础问题，通过以下三个方面进行总结：1.会计恒等式与报表编制——根据提供的公司财务数据（如建筑物、现金、应付贷款、供应费用等项目），首先建立会计恒等式（资产=负债+股东权益），随后编制资产负债表和损益表（如练习题1和3）。重点包括资产项目（建筑物、土地等现金等价物）的价值计算和负债项目（应付账款、股东权益等）的结构确认。此外还探讨各类交易对会计恒等式的影响（练习题2）以及基于不同资源分配原则（直接人工时间、直接人工成本和直接材料成本）的管理费用分摊方法（练习题4）。\n\n2.投资收益与时间价值的计算——这部分包含从练习题5到14关于复利计算的系列问题，关键公式包括终值公式（FV=PV×(1+r)^n）和年金公式。例如题目要求计算单笔投资的终值（题目5、7），确定投资周期以3倍资金（题目9），评估年金的现值或终值（题目8、10~12）。重点还包括比较策略在不同时期收益的方法（题目13）和基于现金流量评估长期投资项目是否经济（题目15~16）。其中在工艺投资可行性评估时需要计算净现金流的平衡点。\n\n3.计算工具辅助设计——最后一个任务（练习题17）要求学生运用计算机编程计算终值的自动化工具，目的是简化前述理论的应用并提高数值计算的适应性。",
        "example": [
            {
                "title": "Jacks公司的资产负债表和损益表编制",
                "content": "练习题1要求基于给定数据制定资产负债表（Assets: 建筑物$22,500+现金$10,000+应收账款$12,500+土地$37,500=Liabs:应付贷款$2,500+应付账款5,000 + Equity:股本$61,500+保留收益$17,500）和相关科目的记录。数据还包括收入项（销售额$25,000）和非流动资产确认。"
            },
            {
                "title": "基于生产信息分配管理费用",
                "content": "练习题4根据不同的计算参数（直接人工时间、直接材料成本等）将$100,000的管理费用分摊到产品中。其中产品A/B/C各自的占比计算结果依选择的计算方式有所不同，例如若选用直接材料成本参数时则分别承担30%、50%、20%。"
            },
            {
                "title": "生产工艺投资的折现现金流评估",
                "content": "练习题15中给定8年内每年$70,000的利润是否能弥补初始$200,000的投资运行费用。计算采用年利率12%，按折现值总和比较利润总额得出判断决策。示例现金流量图显示了购买该工艺是否经济性的依据。"
            }
        ]
    },
    {
        "summary": "运筹学是一门应用数学方法优化决策的科学，与工业工程相比，它更侧重于数学建模和优化算法的应用。确定性模型和随机性模型在运筹学中的区别主要体现在是否考虑不确定性因素。尽管确定性模型忽略了随机性变动，但其在简化分析和计算方面仍有重要应用。大规模系统研究方法因其能够处理复杂系统的优化问题，在工业工程和运筹学中都不可或缺。数学规划问题定义为在特定约束条件下，寻求目标函数的最优解。单变量函数极值的求解通过一阶和二阶导数判别点类型（极小值、极大值或拐点）。二次函数的图形特征由二阶导数的正负决定，正二阶导数使得图形开口向上，负二阶导数则开口向下。局部最优在特定范围内最优，全局最优则在全局范围内最优。搜索法的适用条件取决于问题的性质和目标函数的行为。线性规划问题、分派问题和运输问题都是运筹学的经典问题，各有明确的建模方式和应用实例。运筹学和工业工程的决策应用广泛，涉及不同领域的问题优化。",
        "example": [
            {
                "title": "线性规划的实例",
                "content": "线性规划的实例可以是生产计划问题：通过优化生产组合（x1，x2）使得利润最大化，同时满足材料、劳动力和时间等资源约束。"
            },
            {
                "title": "分派问题的实例",
                "content": "分派问题的实例可以是任务分配：若干工人如何分配到若干任务，使得总成本最小，每位工人仅能分到一个任务。"
            },
            {
                "title": "运输问题的实例",
                "content": "运输问题的实例可以是从多个供应点运送货物到多个需求点，目标是总运输费用最低，满足供应点和需求点间的运输限制和平衡条件。"
            },
            {
                "title": "运筹学或工业工程的决策实例",
                "content": "运筹学的决策实例包括航班调度优化，工业工程的决策实例可以是生产线平衡设计，另外，库存优化政策也是典型的运筹学或工业工程决策应用。"
            }
        ]
    },
    {
        "summary": "本章涵盖了多个运筹学和优化问题的实例。首先，讨论了库存管理问题，包括确定最优订货量和订货点的问题。其次，引入了导数和极点的计算，例如对多项式函数的极值分析以及黑塞矩阵的计算。接着，介绍了线性规划问题，包括约束条件下的资源分配和物流优化。最后，讨论了几种典型的人员和设备最优分配问题，以最大化效益或最小化成本为目标。",
        "example": [
            {
                "title": "库存管理最优订货量和订货点计算",
                "content": "假设某种产品每年的需求量为 980 件, 每件产品每年的库存费用为 20 美元, 每次的订货费用为 50 美元。如果订货提前期为 15 天, 则每次订购量为多少? 订货点为多少?"
            },
            {
                "title": "极点分析",
                "content": "求 \\( 2{x}^{3} - {7x} + 3 \\) 的极点并说明它们是极小值、极大值还是拐点。"
            },
            {
                "title": "线性规划问题求解",
                "content": "绘图求解 \\( {x}_{1} \\) 和 \\( {x}_{2} \\) 的值: \\n\\[{\\mathrm{{TC}}}_{\\min } = 7{x}_{1} + 9{x}_{2}\\] \\n满足约束条件: \\n\\[{18}{x}_{1} + 7{x}_{2} \\geq  {250}\\] \\n\\[3{x}_{1} + 5{x}_{2} \\geq  {84}\\] \\n\\[9{x}_{1} + 2{x}_{2} \\geq  {60}\\] \\n\\[{x}_{1} \\geq  0,{x}_{2} \\geq  0\\]"
            },
            {
                "title": "人员分配优化",
                "content": "6 名服务员为 5 位顾客服务, 所需的往返时间见下面的分派矩阵, 求分派问题的最优解。"
            },
            {
                "title": "运输成本优化",
                "content": "将零件从 3 个生产厂运送给 4 个配送中心,生产厂 1、2、3 每个月分别生产为 24、 34 和 22 单位的零件, 每个配送中心每月需求量为 20 单位, 每个生产厂到各个配送中心的距离 (mile) 。"
            }
        ]
    },
    {
        "summary": "排队论模型中的服务设施和顾客反应是研究的重点。顾客对排队系统的反应包括情绪（如生气）和行为（如离队）。从组织角度看，排队系统的成本主要包括顾客等待时间和员工闲置时间，应通过优化服务资源配置和流程来降低成本。在服务速率和服务者数量的讨论中，若服务率为μ，当服务者数量增加到n时，是否只要满足nμ > λ即可确定最小服务者数量是一个值得商榷的问题，因为实际情况可能会更复杂。当μ = λ时，系统处于平衡状态，但可能增加等待时间，这在理想条件下（稳定、无波动）才行得通，管理者B的担忧是合理的。理解服务时间的分布（包括方差和平均时间1/μ）对优化服务系统至关重要，其可以帮助估算等待时间和负载高峰。在库存管理中，过量库存成本包括资金占用、过期风险和管理成本，而缺货成本包括客户流失、信誉损失和加急采购费用。单周期模型（无订货费）和定期检查模型是库存控制的常用方法，它们的成本核算需要结合需求的分布。批量订单点模型通过设定最小库存限制和提前预警来避免缺货；而周期检查模型则通过缩短检查周期或增加最高库存来防止缺货。当订货费用趋向于零，提前期为常数且需求量在提前期的范围内波动时，存储模型需要调整优化，确保最低库存以降低缺货风险。马尔可夫链中，如果有一个嵌入状态，则该状态的n阶转移概率为1，其余部分可为零。可以同时存在多个嵌入状态，系统最终会根据概率进入其中一种稳定的状态。描述了一个两阶段博彩游戏和体育比赛的某方面作为马尔可夫链的状态转移例子。",
        "example": [
            {
                "title": "排队系统与顾客反应实例",
                "content": "描述打折商店出口检查区、邮局或足球特许看台的排队系统。顾客可能因等待时间过长而产生恼怒情绪，甚至离队，组织则需关注排队成本和顾客流失风险。"
            },
            {
                "title": "服务速率案例",
                "content": "假设如果1个服务者服务率为μ，2个服务者服务率为2μ，是否能直接应用 nμ > λ来确定最小的服务者数量？"
            },
            {
                "title": "库存管理成本示例",
                "content": "经营一家国外特产咖啡和糖果店，列举了三种库存过量成本和三种缺货成本。过量库存会导致占用资金、过期和管理成本，缺货则产生客户流失、信誉损失和加急采购费用。"
            },
            {
                "title": "批量-订货点模型示例",
                "content": "批量订货点模型中使用最低库存设定及时补货机制来避免缺货。而周期性检查模型可以通过增加最高库存或高频订购来确保避免库存中断。"
            },
            {
                "title": "马尔可夫链嵌入状态案例",
                "content": "使用两步赌局或体育比赛作为马尔可夫链的例子。可能包含多个嵌入最终状态，如比赛中领先、落后或平局状态之间的转换关系，并通过转移矩阵描述状态间的变动概率。"
            }
        ]
    },
    {
        "summary": "本章节涉及多个排队论、概率模型和优化问题。首先讨论了泊松分布用于顾客到达和服务时间的指数分布，计算系统容量以确保空间需求。其次，对比机械师维修时间的变量与自动化设备的固定时间对排队系统和等待时间的影响。第三个问题关注服务时间的不同分布对排队人数 $N_q$ 和等待时间 $T_q$ 的影响。面包店的最优进货量问题通过权衡需求概率、成本和收益来解决。批量-订货点模型中，提前期和需求的变异性决定了订货点和安全库存水平。游戏理论中银币的转移概率通过马尔可夫链建模并分析银币转移的状态概率。数字信号的传输受误差概率影响，计算正确的信号接收概率及其条件依赖关系。关于棒球队的击球率问题则构建了马尔可夫链条来分析连续状态的可能性。",
        "example": [
            {
                "title": "自助式洗车站排队系统",
                "content": "到达一个单一自助式洗车站的顾客数服从 $10$ 人/小时的泊松分布。服务时间服从平均数为 $4$ 分钟的指数分布。如果要确保顾客在系统中至少 $96\\%$ 的时间有足够的空间，排队系统中必须能容纳多少辆车？"
            },
            {
                "title": "机械师修理自动化替换的效果",
                "content": "部件以平均为 8 台/小时的泊松分布送给机械师。维修时间长均值为 6 分钟且服从指数分布，当被自动化设备代替后，该时间固定为 7 分钟，这改变会如何影响平均排队部件数量和排队时间？此外当维修平均率变为 8.50 台/小时的常量时会如何？"
            },
            {
                "title": "不同服务分布对等待指标的影响",
                "content": "以每小时 30 人的到达率与均值 1.5 分钟的服务时间为例，在服务时间分别指遵循指数分布、定长分布和方差为指数分布一半的随机分布时等待人数 $N_q$ 和等待时间 $T_q$ 如何变化及其图形表现如何？"
            },
            {
                "title": "面包店最优进货决策",
                "content": "假设保健面包需求稳定在8-10条之间，考虑进货价3美元、卖出价7美元和隔日处理价1美元的背景下，店家应每日订货量为多少以利润最大？再假设需求为泊松λ=10，该订货数量需如何调整？"
            },
            {
                "title": "批量订货点的提前期与变差效应",
                "content": "给定需求量为日均3单位且提前期15天的情况下，当提前期方差改为0天、4天和16天时，要满足97.73%的服务水平需求下安全库存和订货点会如何变化？特别在4天和16天两种情况时安全库存量需要增设为多少？"
            },
            {
                "title": "基于投币游戏的马尔科夫转移",
                "content": "两名玩家最初各有两币的游戏。骰若出现1–4则由掷骰规则决定谁出，否则掷硬币解决胜负。构造其一回合的马尔科夫转移矩阵，然后求出在两掷后一个1币而另一3币的概率，并拓展3掷后的情形。"
            },
            {
                "title": "数字传输的正误接收分析",
                "content": "两位数字传输的可能四种形式被接收时正概率不一例如01信号经两连接器转移后仍受初次接收正确和再次正确两个可能独立或相关的因素影响条件概率。"
            },
            {
                "title": "棒球击球率的嵌入式链条",
                "content": "给定球员0.250的击球率下建立一个局内击中次数的马尔科夫链，并求二击后无中的概率是否构成嵌入式的转换链？"
            }
        ]
    },
    {
        "summary": "本节内容围绕仿真实验和随机性问题的应用展开，涵盖了概率处理、计算机仿真流程设计、效能指标计算以及随机数生成等多个方面。主要内容包括利用不对称硬币的投掷概率进行仿真实验，并使用随机数据序列来验证结果；针对批量-订货点模型设计仿真流程图并加入缺货数量计算步骤；利用概率分布参数计算系统效能指标 \\( e = 5a + 3b + 2ab \\) 并生成样本值；更改机器故障维修的实例的参数以进行更广泛的仿真分析；仿真生产批次中的不合格品检测问题及对应的概率分布等。此外还介绍了均匀分布随机数的生成方法及其应用，如通过乘法同余法生成随机数字直到获得完全的循环序列。",
        "example": [
            {
                "title": "16.1 节的投掷不对称硬币实验仿真",
                "content": "使用特定的概率进行不对称硬币的投掷实验：\\( p(x) = \\\\text{正面} = 0.40, p(x) = \\\\text{反面} = 0.50, p(x) = \\\\text{边缘} = 0.10 \\)"
            },
            {
                "title": "应用15.3.2节的批量-订货点模型",
                "content": "为该模型画一张仿真流程图，加入一个步骤计算每一周期的缺货数量。"
            },
            {
                "title": "使用公式生成效能指标样本",
                "content": "应用效能衡量指标 \\( e = 5a + 3b + 2ab \\)，使用特定的随机数字序列生成该指标的样本。"
            },
            {
                "title": "分析图书馆图书随机取样的方法",
                "content": "均匀分布随机数可以用于图书馆图书随机取样的方法开发。"
            },
            {
                "title": "使用乘法同余方法生成随机数字",
                "content": "此方法可以用来生成随机数字的序列，直至得到完全循环的序列为止。"
            }
        ]
    },
    {},
    {
        "summary": "本章内容介绍了网络计划技术，包括活动、结点表示法以及最早开始和最迟结束时间的计算。通过习题说明了如何确定活动的总时差和关键路径。使用了计划评审技术（PERT）来进行时间估算和概率计算，涉及乐观时间、最可能时间和悲观时间的综合应用，从而计算预期工期、方差以及项目完成概率。此外，通过时间成本优化问题，探讨了如何减少间接成本以确定最佳工期。",
        "example": [
            {
                "title": "小型工厂规划网络图示例",
                "content": "一个小型工厂规划由10步组成，每一步都有紧前作业和活动的作业时间。通过网络图确定最早开始和最迟结束时间，同时找出关键路径和最大总时差的活动。"
            },
            {
                "title": "PERT时间估算示例",
                "content": "使用乐观时间、最可能时间和悲观时间来估算了计划评审技术（PERT）下的时间值，求得了关键路径的预期时间长度、时间方差以及特定时间内完工的概率。"
            },
            {
                "title": "项目完成概率计算示例",
                "content": "基于PERT得到的工期和标准差数据，在30至50天内完成项目的概率被计算出。"
            },
            {
                "title": "时间-成本优化示例",
                "content": "通过表格数据展示了不同工期下的间接成本，以确定最佳的项目工期。间接成本的降低情况直接影响所选择的工期。"
            }
        ]
    },
    {
        "summary": "本章主要探讨了系统的基本定义和特性，并通过对多种实际例子的分析，解释了如何识别和理解系统。内容包括：1）系统的定义及其在不同情境下的适用性分析；2）系统中的要素目标冲突及其解决方案；3）系统业绩指标的设定与评估；4）对不同系统（如自动洗衣机、快餐店等）的要素、子系统、目标、功能、输入输出和转化能力的具体描述；5）控制系统的设计（如自动开灯系统、闭环烤面包箱等）；6）人体控制系统的生理机制及其在闭环和开放系统中的表现；7）经济系统中的反馈控制机制（如原油价格的供需平衡）。",
        "example": [
            {
                "title": "系统定义的适用性分析",
                "content": "分析你学习本课程时所在的班级是否构成一个系统。"
            },
            {
                "title": "系统业绩指标",
                "content": "描述你所在的系的系统业绩指标，如学生毕业率、教师研究产出等。"
            },
            {
                "title": "自动洗衣机系统",
                "content": "分析自动洗衣机的各要素如洗衣机本体、洗涤剂、用户输入，其功能为洗涤衣物，输入为水和电，输出为干净的衣物。"
            },
            {
                "title": "控制系统设计",
                "content": "设计一个能依据环境光线自动开灯或关灯的控制系统，保证全年有效工作。"
            },
            {
                "title": "人体层级结构",
                "content": "绘制类似于图18.1的人体层级结构图，从分子、细胞到器官等层次进行分类。"
            }
        ]
    },
    {
        "summary": "本章介绍了关于使命描述、关键成果领域（KRAs）以及组织设计的多个相关任务。首先涉及评估现有社团的使命描述，若不存在则需创建一个；其次介绍了为不同类型的组织（如大学、银行、医院等）构建合理的KRAs的方法。接下来的任务分别围绕KRAs相关目标的设定、管理控制体系的分析与优化、组织设计的理论基础与实践应用展开。最后还针对不同行业在不同国家中的发展状况，给出了生命周期各阶段的划分和分析。通过这些学习内容，能帮助读者从组织战略到实际操作的各个维度加深对于企业组织及管理的理解。",
        "example": [
            {
                "title": "关键成果领域（KRAs）创建实例",
                "content": "根据德鲁克的建议以及为工业工程师协会所建议的关键成果领域，为大学、银行等各类机构制定适宜的KRAs。如银行的关键成果领域包括资金管理以及客户服务。"
            },
            {
                "title": "组织结构分析",
                "content": "为书店、某一城市的市政管理系统等设计理想的组织机构，并据此给出必要的管理控制体系，如目标和业绩标准。"
            },
            {
                "title": "生命周期的行业分析",
                "content": "使用图表来分析不同行业（如钢铁、纺织等）在美国、日本、墨西哥、肯尼亚不同发展阶段中所处的生命周期阶段。"
            }
        ]
    },
    {
        "summary": "这一章节主要讨论了信息系统的基本概念、设计过程以及数据处理操作，并涉及了信息与数据的区分、管理信息系统（MIS）的发展、决策支持系统（DSS）的基本概念，以及与数据库设计方法的比较和信息系统在设计和应用中的特点。内容包括数据和信息的定义区分，手工系统和信息系统的比较；管理信息系统的发展历程；决策支持系统与传统的信息系统的不同点；数据库设计中传统的文件处理方法和现代数据库方法的差别；基本的数据处理操作的定义和对手工系统的适用性讨论；信息系统设计过程的概念及与工业系统的类比；好信息和高效信息系统的特征定义和设计步骤；以及如何应用到现实案例（如为一个大学协会或校园数据通信网络设计一套新系统）等问题。",
        "example": [
            {
                "title": "信息与数据的区分实例",
                "content": "一种情况是，一条特定的交通指示灯对于过路人来说可能是数据（单纯的亮灭信号），但对于交通工程师来讲则是信息（反映了某个特定区域交通流量的信号和规律）。这就是区分‘数据’和‘信息’的一个实例。"
            },
            {
                "title": "数据库设计的传统方法对比现代方法",
                "content": "传统方法依赖文件处理，将文件独立使用，数据共享能力低。现代方法采用数据库理论整合数据，通过统一数据库实现高效共享减少冗余,数据间可以逻辑关联。现代数据库设计方法的优势提高了数据的安全性和整合能力减少人为错误。这一部分讨论了设计上的对比差别并强调了现代方法更加适用。"
            }
        ]
    },
    {
        "summary": "本章主要探讨了人力资源管理的多种职能及其工业工程师在其中的角色，主要包括培训和教育的区分、福利与公益的重要性以及两者对员工激励的影响。招聘不同层次员工的策略差异也被详细讨论，强调人力资源管理经理在员工筛选中的潜在角色。绩效评价的方法如清单法和等级标度法的区别，以及可能的负光效应也被纳入讨论。在监管方面，监督与领导的差异及有效主管的特质被强调。激励理论方面，比较了马斯洛的需求层次理论和赫茨伯格的二元因素理论。讨论了为什么经过严格筛选的员工群体质量通常较高。最后，提到了工业工程师继续教育的必要性。",
        "example": [
            {
                "title": "培训与教育的例证",
                "content": "在21.3节的描述中，强调了你所经历的培训与实际教育案例的区别。请问是否有过类似在职业初期接受的针对性的技能培训而非系统性的教育?"
            },
            {
                "title": "负光圈效应的实际表现",
                "content": "你能给出某个企业因领导光环效应最终导致员工评价不公正的例子吗？比如经理因其他优秀表现的掩盖使员工某些缺点被忽略。"
            }
        ]
    },
    {
        "summary": "本章主要内容是设计和管理不同类型的培训计划及安全计划。培训计划的类型包括铲车司机和管理层的培训，培训计划的讲授方法应结合实际需求进行选择。培训计划需要包括相应的学科领域，如铲车操作技能、安全规程、管理原则等。管理层的培训还需要借助类似游戏的互动方法来演示信息和一致性传递的问题。安全计划需要联系本地公司或大学，了解他们现有的措施和步骤。此外，本章介绍了使用不连续等级标度方法来划分职业等级，并对信息传递不一致性进行分析，如用游戏来展示不同传递环节的失真效应并提出改进一致性的方法。",
        "example": [
            {
                "title": "铲车司机培训计划",
                "content": "设计一个铲车司机的培训计划，概略说明应采用的讲授方法，包括实际操作和理论相结合的方法来确保培训效果。"
            },
            {
                "title": "本地安全计划",
                "content": "联系一个本地公司或大学，调查其现有的安全计划。通过了解他们采取的具体措施来评估其详细步骤和实施情况。"
            },
            {
                "title": "管理层培训计划",
                "content": "设计管理层的培训计划，说明应涵盖的管理学科领域的核心内容以及选择合适的讲授方法如小组讨论和案例分析来实现培训目标。"
            },
            {
                "title": "不连续等级标度例子",
                "content": "根据图21.1的例子，为快餐店的基层主管设计类似的不连续等级标度图表，帮助他们进行职业评价与发展分析。"
            },
            {
                "title": "信息传递游戏案例",
                "content": "通过游戏的方式演示信息传递过程的不一致，利用图21.6分析信息最后与原版本不同的原因，并提出如何增强信息传递的一致性与准确性。"
            }
        ]
    },
    {
        "summary": "该章节主要介绍了泊松分布的累积概率和正态分布的累积概率表。表中包含两部分内容：一部分是不合格品数或疵数小于等于x时的概率（表B.2），另一部分展示了正态分布从-∞到Z=(x-μ)/σ的累积概率（表B.2）。后者以表格形式详细列出从Z=-3.5至0.1不同值对应的累积概率（例如，Z=-3.5对应的累积概率为0.00023等）。此外，累积概率的单位省略了小数点。",
        "example": [
            {
                "title": "泊松分布与不合格品数例子",
                "content": "表的数据主体部分展示的是不合格品数或疵数小于等于某个特定值x时的累积概率。例如，某组数据中可能包含不合格品数从1到5时的累积概率。"
            },
            {
                "title": "正态分布累积概率实例",
                "content": "表格中Z=-3.5对应的累积概率为0.00023；Z=-3.0为0.00135；而在Z=-2.0为0.0110等等。该表的数据直观地展示了不同的Z值对应该区域内的累积概率值的大小变化规律。"
            }
        ]
    }
]